
## :x: Apply Failed

[CI link](https://github.com/malachowski-labs/infrastructure/actions/runs/21108407060)



<pre><code>Error: Provider produced invalid object

Provider &#34;module.talos.provider[\&#34;registry.opentofu.org/hashicorp/helm\&#34;]&#34;
produced a value for module.talos.data.helm_template.hcloud_ccm that is not
wholly known.

This is a bug in the provider, which should be reported in the provider&#39;s own
issue tracker.

Error: Provider produced invalid object

Provider &#34;module.talos.provider[\&#34;registry.opentofu.org/hashicorp/helm\&#34;]&#34;
produced a value for module.talos.data.helm_template.cilium_default[0] that
is not wholly known.

This is a bug in the provider, which should be reported in the provider&#39;s own
issue tracker.
::error::OpenTofu exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.talos.data.hcloud_image.x86[0]: Reading...
module.talos.data.hcloud_datacenter.this: Reading...
data.cloudflare_zone.this: Reading...
data.google_secret_manager_secret_version.argocd_app_pem_key: Reading...
data.cloudflare_zone.this: Read complete after 0s [id=aff336ce5012d1e29eb613ba0ec54d9a]
module.talos.data.hcloud_image.x86[0]: Read complete after 0s
module.talos.data.hcloud_datacenter.this: Read complete after 0s [name=hel1-dc2]
module.talos.data.hcloud_location.this: Reading...
data.google_secret_manager_secret_version.argocd_app_pem_key: Read complete after 0s [id=projects/671067631752/secrets/argocd-gh-app-pem-key/versions/1]
module.talos.data.hcloud_location.this: Read complete after 0s [name=hel1]
module.talos.data.helm_template.hcloud_ccm: Reading...
module.talos.data.helm_template.cilium_default[0]: Reading...

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

OpenTofu planned the following actions, but then encountered a problem:

  # module.talos.data.http.talos_health[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "talos_health" {
      + body                 = (known after apply)
      + id                   = (known after apply)
      + insecure             = true
      + response_body        = (known after apply)
      + response_body_base64 = (known after apply)
      + response_headers     = (known after apply)
      + status_code          = (known after apply)
      + url                  = (known after apply)

      + retry {
          + attempts     = 60
          + max_delay_ms = 5000
          + min_delay_ms = 5000
        }
    }

  # module.talos.data.talos_client_configuration.this will be read during apply
  # (config refers to values not yet known)
 <= data "talos_client_configuration" "this" {
      + client_configuration = (known after apply)
      + cluster_name         = "prod.malachowski.me"
      + endpoints            = (known after apply)
      + id                   = (known after apply)
      + talos_config         = (sensitive value)
    }

  # module.talos.data.talos_machine_configuration.control_plane["control-plane-1"] will be read during apply
  # (config refers to values not yet known)
 <= data "talos_machine_configuration" "control_plane" {
      + cluster_endpoint      = "https://kube.cluster.local:6443"
      + cluster_name          = "prod.malachowski.me"
      + config_patches        = [
          + (sensitive value),
        ]
      + docs                  = false
      + examples              = false
      + id                    = (known after apply)
      + kubernetes_version    = "1.30.3"
      + machine_configuration = (sensitive value)
      + machine_secrets       = (known after apply)
      + machine_type          = "controlplane"
      + talos_version         = "v1.11.0"
    }

  # module.talos.hcloud_firewall.this[0] will be created
  + resource "hcloud_firewall" "this" {
      + id     = (known after apply)
      + labels = {
          + "cluster" = "prod.malachowski.me"
        }
      + name   = "prod.malachowski.me"

      + rule {
          + description     = "Allow Incoming Requests to Kube API Server"
          + destination_ips = []
          + direction       = "in"
          + port            = "6443"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + description     = "Allow Incoming Requests to Talos API Server"
          + destination_ips = []
          + direction       = "in"
          + port            = "50000"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
    }

  # module.talos.hcloud_network.this will be created
  + resource "hcloud_network" "this" {
      + delete_protection        = false
      + expose_routes_to_vswitch = false
      + id                       = (known after apply)
      + ip_range                 = "10.0.0.0/16"
      + labels                   = {
          + "cluster" = "prod.malachowski.me"
        }
      + name                     = "prod.malachowski.me"
    }

  # module.talos.hcloud_network_subnet.nodes will be created
  + resource "hcloud_network_subnet" "nodes" {
      + gateway      = (known after apply)
      + id           = (known after apply)
      + ip_range     = "10.0.1.0/24"
      + network_id   = (known after apply)
      + network_zone = "eu-central"
      + type         = "cloud"
    }

  # module.talos.hcloud_placement_group.control_plane will be created
  + resource "hcloud_placement_group" "control_plane" {
      + id      = (known after apply)
      + labels  = {
          + "cluster" = "prod.malachowski.me"
        }
      + name    = "control-plane"
      + servers = (known after apply)
      + type    = "spread"
    }

  # module.talos.hcloud_placement_group.worker will be created
  + resource "hcloud_placement_group" "worker" {
      + id      = (known after apply)
      + labels  = {
          + "cluster" = "prod.malachowski.me"
        }
      + name    = "worker"
      + servers = (known after apply)
      + type    = "spread"
    }

  # module.talos.hcloud_primary_ip.control_plane_ipv4[0] will be created
  + resource "hcloud_primary_ip" "control_plane_ipv4" {
      + assignee_id       = (known after apply)
      + assignee_type     = "server"
      + auto_delete       = false
      + datacenter        = "hel1-dc2"
      + delete_protection = false
      + id                = (known after apply)
      + ip_address        = (known after apply)
      + ip_network        = (known after apply)
      + labels            = {
          + "cluster" = "prod.malachowski.me"
          + "role"    = "control-plane"
        }
      + location          = (known after apply)
      + name              = "control-plane-1-ipv4"
      + type              = "ipv4"
    }

  # module.talos.hcloud_server.control_planes["control-plane-1"] will be created
  + resource "hcloud_server" "control_planes" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = "hel1-dc2"
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "350223091"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "cluster" = "prod.malachowski.me"
          + "role"    = "control-plane"
        }
      + location                   = (known after apply)
      + name                       = "control-plane-1"
      + placement_group_id         = (known after apply)
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx23"
      + shutdown_before_deletion   = false
      + ssh_keys                   = (known after apply)
      + status                     = (known after apply)
      + user_data                  = (sensitive value)

      + network {
          + alias_ips   = []
          + ip          = "10.0.1.101"
          + mac_address = (known after apply)
          + network_id  = (known after apply)
        }

      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = false
        }
    }

  # module.talos.hcloud_ssh_key.this will be created
  + resource "hcloud_ssh_key" "this" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + labels      = {
          + "cluster" = "prod.malachowski.me"
        }
      + name        = "default"
      + public_key  = (sensitive value)
    }

  # module.talos.talos_cluster_kubeconfig.this[0] will be created
  + resource "talos_cluster_kubeconfig" "this" {
      + certificate_renewal_duration    = "720h"
      + client_configuration            = (known after apply)
      + endpoint                        = (known after apply)
      + id                              = (known after apply)
      + kubeconfig_raw                  = (sensitive value)
      + kubernetes_client_configuration = (known after apply)
      + node                            = (known after apply)
    }

  # module.talos.talos_machine_bootstrap.this[0] will be created
  + resource "talos_machine_bootstrap" "this" {
      + client_configuration = (known after apply)
      + endpoint             = (known after apply)
      + id                   = (known after apply)
      + node                 = (known after apply)
    }

  # module.talos.talos_machine_secrets.this will be created
  + resource "talos_machine_secrets" "this" {
      + client_configuration = (known after apply)
      + id                   = (known after apply)
      + machine_secrets      = (known after apply)
      + talos_version        = "v1.11.0"
    }

  # module.talos.tls_private_key.ssh_key[0] will be created
  + resource "tls_private_key" "ssh_key" {
      + algorithm                     = "ED25519"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + kubeconfig = (sensitive value)

Warning: Argument is deprecated

  with module.talos.hcloud_primary_ip.control_plane_ipv4[0],
  on .terraform/modules/talos/network.tf line 63, in resource "hcloud_primary_ip" "control_plane_ipv4":
  63:   datacenter    = data.hcloud_datacenter.this.name

The datacenter attribute is deprecated and will be removed after 1 July 2026.
Please use the location attribute instead. See
https://docs.hetzner.cloud/changelog#2025-12-16-phasing-out-datacenters.

(and one more similar warning elsewhere)

Error: Provider produced invalid object

Provider "module.talos.provider[\"registry.opentofu.org/hashicorp/helm\"]"
produced a value for module.talos.data.helm_template.hcloud_ccm that is not
wholly known.

This is a bug in the provider, which should be reported in the provider's own
issue tracker.

Error: Provider produced invalid object

Provider "module.talos.provider[\"registry.opentofu.org/hashicorp/helm\"]"
produced a value for module.talos.data.helm_template.cilium_default[0] that
is not wholly known.

This is a bug in the provider, which should be reported in the provider's own
issue tracker.
::error::OpenTofu exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"infra-apply","PRNumber":10,"Program":"tfcmt","SHA1":"205db2a5b6178da297ab3a96d75141e07094d738","Vars":{},"WorkflowName":"infra-apply"} -->